const ASCII =
  "\u0000☺☻♥♦♣♠•◘○◙♂♀♪♫☼" +
  "►◄↕‼¶§▬↨↑↓→←∟↔▲▼" +
  " !\"#$%&'()*+,-./" +
  "0123456789:;<=>?" +
  "@ABCDEFGHIJKLMNO" +
  "PQRSTUVWXYZ[\\]^_" +
  "`abcdefghijklmno" +
  "pqrstuvwxyz{|}~⌂";

export const cp437 = ASCII +
  "ÇüéâäàåçêëèïîìÄÅ" +
  "ÉæÆôöòûùÿÖÜ¢£¥₧ƒ" +
  "áíóúñÑªº¿⌐¬½¼¡«»" +
  "░▒▓│[e]┤╡╢╖╕╣║╗╝" +
  "└┴┬├─┼╞╟╚╔╩╦╠═╬╧" +
  "╨╤╥╙╘╒╓╫╪┘┌█▄▌▐▀" +
  "αßΓπΣσµτΦΘΩδ∞φε∩" +
  "≡±≥≤⌠⌡÷≈°∙·√ⁿ²■\u00A0";

export const cp1251 = ASCII +
  "ЂЃ‚ѓ„…†‡€‰Љ‹ЊЌЋЏ" +
  "ђ‘’“”•–—™љ›њќћџ" +
  "\u00A0Ўў\u0408¤Ґ¦§Ё©Є«¬\u00AD®Ї" +
  "°±Ііґµ¶·ё№є»јЅѕї" +
  "АБВГДЕЖЗИЙКЛМНОП" +
  "РСТУФХЦЧШЩЪЫЬЭЮЯ" +
  "абвгдежзийклмноп" +
  "рстуфхцчшщъыьэюя";

export const cp1252 = ASCII +
  "€‚ƒ„…†‡ˆ‰Š‹ŒŽ" +
  "‘’“”•–—˜™š›œžŸ" +
  "\u00A0¡¢£¤¥¦§¨©ª«¬\u00AD®¯" +
  "°±²³´µ¶·¸¹º»¼½¾¿" +
  "ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏ" +
  "ÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß" +
  "àáâãäåæçèéêëìíîï" +
  "ðñòóôõö÷øùúûüýþÿ";
